#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_CTYPE, "RUS");
	task2();
	
}

int task1()
{
	printf("\t %s", "Это текст1");
	printf("%20s\n", "Это текст");
	printf("%10.5f\n", 12.234657);

	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Деление %d на %d равен %d\n", 7, 5, 7 / 5);
	printf("Умножение %d на %d равно %d\n", 2000, 4, 2000 * 4);

	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);

	printf("%d\n \t%d\n \t\t%d\n", 1, 2, 3);
	printf("%d\n %5d\n %10d\n", 1, 2, 3);
	printf("%+d\,\n %+5d\,\n %+10d\,\n", 1, 2, 3);
	printf("%+d\n %+5d\n %+10d\n", 1, 2, 3);
}

int task2()
{
	int N, K;
	N = 10;
	K = 30;

	/*printf("Сейчас %d часов %d минут 00 секунд\n", 10, 10);
	printf("Идёт %d минута суток\n", 10 * 60 + 10);
	printf("До полуночи осталось %d часов и %d минут\n", 13, 50);
	printf("с 8.00 прошло %d секунд\n", 10 * 60 * 60 + 10 * 60);
	printf("Текущий час = %d/24 суток и текущая минута = %d/60 часа\n", 10, 10);*/

	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идёт %d минута суток\n", N * 60 + K);
	printf("До полуночи осталось %d часов и %d минут\n", 24-N-1, 60-K);
	printf("с 8.00 прошло %d секунд\n", (N - 8) * 60 * 60 + K * 60);
	printf("Текущий час = %4.2f суток и текущая минута = %4.2f часа\n", N/24., K/60.);
}